fix: ascii architecture to mermaid
